[
{
  "_id": {
    "$oid": "68fdbb12dd08ede9e662a1c1"
  },
  "title": "Varanasi: The Eternal City of Light - A Spiritual Journey",
  "slug": "varanasi-eternal-city-of-light-spiritual-journey",
  "excerpt": "Discover the spiritual heart of India in Varanasi, where ancient traditions, sacred ghats, and divine ceremonies create an unforgettable pilgrimage experience along the holy Ganges.",
  "content": "\n        <p>Varanasi, also known as Kashi and Banaras, is India's oldest continuously inhabited city and one of the world's most sacred pilgrimage sites. This ancient city on the western bank of the Ganges River is believed to be the abode of Lord Shiva and represents the spiritual heart of Hinduism.</p>\n        \n        <h2>The Sacred Ghats</h2>\n        <p>The city's 84 ghats create a living tapestry of spiritual activities, from dawn aarti ceremonies to evening Ganga Aarti that illuminate the night sky with thousands of oil lamps.</p>\n        ",
  "contentSections": [
    {
      "id": "section-1",
      "type": "image-text",
      "title": "The Sacred Ghats of Varanasi",
      "content": "<p>Varanasi's 84 ghats are the soul of the city, creating a magnificent amphitheater along the Ganges River. Each ghat has its own significance and story, from the most famous Dashashwamedh Ghat where the evening Ganga Aarti takes place, to the peaceful Assi Ghat where pilgrims start their spiritual journey.</p><p>The ghats come alive before dawn as devotees perform their morning ablutions, priests conduct sacred ceremonies, and the city awakens to the sound of temple bells and chanting.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1561361513-2d000a50f0dc?w=800&h=600&fit=crop",
        "alt": "Varanasi ghats during Ganga Aarti",
        "caption": "The mesmerizing Ganga Aarti ceremony at Dashashwamedh Ghat"
      },
      "imagePosition": "left",
      "order": 1
    },
    {
      "id": "section-2",
      "type": "image-text",
      "title": "Kashi Vishwanath Temple: The Golden Temple",
      "content": "<p>At the heart of Varanasi stands the magnificent Kashi Vishwanath Temple, dedicated to Lord Shiva. This 18th-century temple, with its stunning gold-plated dome and intricate architecture, is one of Hinduism's most revered shrines and one of the twelve Jyotirlingas.</p><p>The temple complex includes the Jnana Vapi (Well of Wisdom) and various smaller shrines. The temple's significance is enhanced by its location in the ancient city of Kashi, making it a powerful center for spiritual liberation (Moksha).</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587474260584-136574528ed5?w=800&h=600&fit=crop",
        "alt": "Kashi Vishwanath Temple golden dome",
        "caption": "The golden dome of Kashi Vishwanath Temple shines against the evening sky"
      },
      "imagePosition": "right",
      "order": 2
    },
    {
      "id": "section-3",
      "type": "text",
      "title": "Dawn to Dusk: Varanasi's Spiritual Rhythms",
      "content": "<h3>Dawn Aarti Ceremony</h3><p>Wake before sunrise to witness the sacred dawn rituals. Priests perform ancient ceremonies with bells, conch shells, and incense, welcoming the new day with prayers and offerings to Mother Ganga. The sight of the sun rising over the ghats is truly divine.</p><h3>Ghat Walking Experience</h3><p>Walk along the ghats to experience different facets of spiritual life - from the burning ghats where cremations take place, symbolizing liberation from the cycle of rebirth, to the bathing ghats where pilgrims perform ritual ablutions.</p><h3>Evening Ganga Aarti</h3><p>The evening Ganga Aarti at Dashashwamedh Ghat is a spectacular ceremony involving multiple priests, fire lamps, incense, and synchronized movements that create a mesmerizing spiritual experience.</p>",
      "order": 3
    },
    {
      "id": "section-4",
      "type": "image-text",
      "title": "Sunrise Boat Ride on the Sacred Ganges",
      "content": "<p>A sunrise boat ride on the Ganges offers the most serene and spiritual perspective of Varanasi. As you glide along the holy river, witness the city's awakening - pilgrims performing morning prayers, sadhus in meditation, and the golden light reflecting off the ancient temples and palaces.</p><p>This peaceful journey allows you to see all the major ghats from the water and understand why the Ganges is considered the lifeline of this sacred city.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587135941948-670b381f08ce?w=800&h=600&fit=crop",
        "alt": "Sunrise boat ride on Ganges in Varanasi",
        "caption": "Sunrise boat ride offers the most peaceful way to experience Varanasi's ghats"
      },
      "imagePosition": "center",
      "order": 4
    },
    {
      "id": "section-5",
      "type": "text",
      "title": "Essential Temples and Sacred Sites",
      "content": "<h3>Sankat Mochan Hanuman Temple</h3><p>Dedicated to Lord Hanuman, this temple is believed to relieve devotees from troubles and obstacles. The temple resonates with continuous chanting and bhajans throughout the day.</p><h3>Durga Temple (Monkey Temple)</h3><p>Famous for its red spire and the many monkeys that inhabit the complex, this temple is dedicated to Goddess Durga and is particularly crowded during Navaratri.</p><h3>Tulsi Manas Temple</h3><p>Built at the place where Tulsidas wrote the Ramcharitmanas, this modern marble temple showcases beautiful carvings depicting scenes from the Ramayana.</p><h3>Bharat Mata Temple</h3><p>Unique in having a relief map of India carved in marble instead of traditional deity idols, representing the concept of Mother India.</p>",
      "order": 5
    },
    {
      "id": "section-6",
      "type": "image-text",
      "title": "Cultural Experiences in Varanasi",
      "content": "<p>Beyond its spiritual significance, Varanasi is a treasure trove of cultural experiences. Attend a classical music concert at one of the ghats, explore the narrow lanes filled with silk weavers creating the famous Banarasi sarees, or visit the ancient Banaras Hindu University.</p><p>The city's culinary scene offers everything from street food delicacies like kachori sabzi and lassi to traditional thalis served in heritage restaurants.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1544008230-ac1e1fb4f4f4?w=800&h=600&fit=crop",
        "alt": "Traditional culture in Varanasi",
        "caption": "Varanasi's rich cultural heritage extends beyond spirituality to music, art, and cuisine"
      },
      "imagePosition": "left",
      "order": 6
    },
    {
      "id": "section-7",
      "type": "text",
      "title": "Planning Your Varanasi Visit",
      "content": "<h3>Best Time to Visit</h3><p>October to March offers the most pleasant weather. Avoid the extreme summer heat (April-June) and heavy monsoons (July-September). Winter mornings can be foggy but create a mystical atmosphere.</p><h3>Where to Stay</h3><p>Choose from heritage hotels overlooking the ghats, budget guesthouses in the old city, or modern hotels in newer areas. Staying near the ghats offers the most authentic experience.</p><h3>Getting Around</h3><p>Walk through the narrow lanes of the old city, take cycle rickshaws for short distances, or use boats for ghat-hopping. The old city is best explored on foot.</p><h3>Duration</h3><p>Plan for at least 3-4 days to experience the city's spiritual rhythms properly. This allows time for both dawn and evening ceremonies, temple visits, and cultural exploration.</p>",
      "order": 7
    }
  ],
  "featuredImage": {
    "url": "https://images.unsplash.com/photo-1561361513-2d000a50f0dc?w=800&h=400&fit=crop",
    "alt": "Varanasi ghats at sunrise"
  },
  "images": [],
  "author": {
    "$oid": "68fdbb0fdd08ede9e662a188"
  },
  "categories": [
    {
      "$oid": "68fdbb11dd08ede9e662a199"
    }
  ],
  "tags": [
    "varanasi",
    "india",
    "spiritual",
    "hinduism",
    "temples",
    "ganges",
    "ghats",
    "pilgrimage",
    "kashi",
    "banaras"
  ],
  "status": "published",
  "isPremium": false,
  "isFeatured": true,
  "readTime": 8,
  "viewCount": 0,
  "likeCount": 0,
  "commentCount": 0,
  "likes": [],
  "comments": [],
  "publishedAt": {
    "$date": "2025-10-25T06:09:22.095Z"
  },
  "createdAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "updatedAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "68fdbb12dd08ede9e662a1c2"
  },
  "title": "Ayodhya: Birthplace of Lord Rama - A Sacred Pilgrimage",
  "slug": "ayodhya-birthplace-lord-rama-sacred-pilgrimage",
  "excerpt": "Explore Ayodhya, the sacred birthplace of Lord Rama, where ancient legends come alive through magnificent temples, spiritual sites, and the newly constructed Ram Mandir complex.",
  "content": "\n        <p>Ayodhya, located in Uttar Pradesh, is one of Hinduism's seven most sacred cities (Sapta Puri). This ancient city is revered as the birthplace of Lord Rama, the seventh avatar of Lord Vishnu, and the setting for the epic Ramayana. The city's name itself means 'not to be warred against,' signifying its sacred and invincible status.</p>\n        \n        <h2>Modern Renaissance</h2>\n        <p>Modern Ayodhya is undergoing a remarkable renaissance with magnificent temples and world-class infrastructure, making it more accessible for pilgrims while preserving its ancient spiritual essence.</p>\n        ",
  "contentSections": [
    {
      "id": "section-1",
      "type": "image-text",
      "title": "Ram Mandir: A Modern Marvel of Spirituality",
      "content": "<p>The newly constructed Ram Mandir stands as a testament to faith, devotion, and architectural excellence. This magnificent temple complex, built with pink sandstone from Rajasthan, features intricate carvings, beautiful sculptures, and a serene atmosphere that's perfect for meditation and prayer.</p><p>The temple's design incorporates traditional Hindu architectural elements while embracing modern construction techniques. The complex includes multiple shrines, beautiful gardens, and spaces for cultural activities, making it a complete spiritual destination.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587135941948-670b381f08ce?w=800&h=600&fit=crop",
        "alt": "Ram Mandir in Ayodhya",
        "caption": "The magnificent Ram Mandir complex showcases traditional Hindu architecture"
      },
      "imagePosition": "center",
      "order": 1
    },
    {
      "id": "section-2",
      "type": "image-text",
      "title": "Hanuman Garhi: The Fortress Temple",
      "content": "<p>Perched on a hill, Hanuman Garhi is one of Ayodhya's most important temples, dedicated to Lord Hanuman. This ancient temple complex resembles a fortress with its high walls and offers panoramic views of the entire city. The temple is particularly famous for its massive bell and the continuous chanting of 'Ram Dhun' throughout the day.</p><p>Legend says that Hanuman lived here in a cave and guarded the city of Ayodhya. The temple attracts thousands of devotees, especially on Tuesdays and Saturdays, which are considered auspicious for Hanuman worship.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1544008230-ac1e1fb4f4f4?w=800&h=600&fit=crop",
        "alt": "Hanuman Garhi temple in Ayodhya",
        "caption": "Hanuman Garhi temple offers panoramic views of Ayodhya"
      },
      "imagePosition": "left",
      "order": 2
    },
    {
      "id": "section-3",
      "type": "text",
      "title": "Sacred Sites and Ancient Temples",
      "content": "<h3>Kanak Bhavan</h3><p>This beautiful temple is believed to be the place where Lord Rama and Sita lived as a royal couple. The temple showcases traditional North Indian architecture with ornate carvings, beautiful paintings, and a peaceful courtyard perfect for contemplation.</p><h3>Nageshwarnath Temple</h3><p>One of the 12 Jyotirlingas, this ancient temple houses a self-manifested lingam and is associated with the legend of Lord Shiva saving Ayodhya from destruction. The temple's architecture reflects the ancient Gupta period style.</p><h3>Treta Ke Thakur</h3><p>This temple marks the spot where Lord Rama performed the Ashwamedha Yagna. The temple complex includes beautiful gardens and hosts various cultural programs throughout the year.</p>",
      "order": 3
    },
    {
      "id": "section-4",
      "type": "image-text",
      "title": "Sarayu River: The Sacred Waters",
      "content": "<p>The Sarayu River, flowing alongside Ayodhya, holds immense spiritual significance in Hindu mythology. According to the Ramayana, Lord Rama took Jal Samadhi (water meditation) in this river. The newly developed ghats along the Sarayu offer beautiful spaces for prayer, meditation, and evening aarti ceremonies.</p><p>A boat ride on the Sarayu during sunset provides a peaceful experience and offers beautiful views of the illuminated temples and the Ram Mandir complex reflected in the holy waters.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587474260584-136574528ed5?w=800&h=600&fit=crop",
        "alt": "Sarayu River ghats in Ayodhya",
        "caption": "The sacred Sarayu River with its beautifully developed ghats"
      },
      "imagePosition": "right",
      "order": 4
    },
    {
      "id": "section-5",
      "type": "text",
      "title": "Festivals and Spiritual Events",
      "content": "<h3>Ram Navami</h3><p>The celebration of Lord Rama's birthday is the most significant festival in Ayodhya. The entire city comes alive with processions, bhajans, and special prayers. The Ram Mandir hosts grand celebrations with elaborate decorations and cultural programs.</p><h3>Deepotsav</h3><p>During Diwali, Ayodhya celebrates Deepotsav, commemorating Lord Rama's return from exile. Millions of diyas (oil lamps) illuminate the city, creating a magical atmosphere. This celebration has gained international recognition and attracts visitors from around the world.</p><h3>Kartik Purnima</h3><p>This full moon day in the month of Kartik is considered highly auspicious for taking a holy dip in the Sarayu River and visiting temples.</p>",
      "order": 5
    },
    {
      "id": "section-6",
      "type": "image-text",
      "title": "Cultural Heritage and Local Experiences",
      "content": "<p>Ayodhya offers rich cultural experiences beyond its temples. Visit the local markets for traditional handicrafts, religious artifacts, and sweets unique to the region. The city is famous for its traditional 'Ayodhya ki Peda' and other devotional items.</p><p>Participate in evening aarti ceremonies, listen to Ramayana recitations by local scholars, or join bhajan sessions at various temples. The city also offers heritage walks that take you through ancient lanes filled with stories from the Ramayana.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1561361513-2d000a50f0dc?w=800&h=600&fit=crop",
        "alt": "Traditional culture in Ayodhya",
        "caption": "Ayodhya's cultural heritage extends to traditional crafts and spiritual practices"
      },
      "imagePosition": "center",
      "order": 6
    },
    {
      "id": "section-7",
      "type": "text",
      "title": "Planning Your Ayodhya Pilgrimage",
      "content": "<h3>Best Time to Visit</h3><p>October to March offers pleasant weather for temple visits and outdoor activities. Avoid the hot summer months (April-June). Visit during Ram Navami or Deepotsav for special celebrations, but expect larger crowds.</p><h3>Getting There</h3><p>Ayodhya is well-connected by rail and road. The nearest airport is in Lucknow (130 km away). Regular trains connect Ayodhya to major Indian cities. Local transportation includes auto-rickshaws, cycle rickshaws, and buses.</p><h3>Accommodation</h3><p>Choose from dharamshalas (pilgrim rest houses), budget hotels, or newly built modern accommodations. Many options are available near the Ram Mandir complex and other major temples.</p><h3>Duration</h3><p>Plan for 2-3 days to visit all major temples and participate in spiritual activities. This allows time for unhurried darshan, participation in ceremonies, and exploration of the city's cultural heritage.</p>",
      "order": 7
    }
  ],
  "featuredImage": {
    "url": "https://images.unsplash.com/photo-1587135941948-670b381f08ce?w=800&h=400&fit=crop",
    "alt": "Ram Mandir Ayodhya"
  },
  "images": [],
  "author": {
    "$oid": "68fdbb0fdd08ede9e662a188"
  },
  "categories": [
    {
      "$oid": "68fdbb11dd08ede9e662a199"
    }
  ],
  "tags": [
    "ayodhya",
    "rama",
    "hinduism",
    "temples",
    "pilgrimage",
    "ramayana",
    "spiritual",
    "india",
    "sarayu",
    "ram-mandir"
  ],
  "status": "published",
  "isPremium": false,
  "isFeatured": true,
  "readTime": 7,
  "viewCount": 0,
  "likeCount": 0,
  "commentCount": 0,
  "likes": [],
  "comments": [],
  "publishedAt": {
    "$date": "2025-10-24T06:09:22.095Z"
  },
  "createdAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "updatedAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "68fdbb12dd08ede9e662a1c3"
  },
  "title": "Prayagraj: The Sacred Confluence - Home of Kumbh Mela",
  "slug": "prayagraj-sacred-confluence-home-kumbh-mela",
  "excerpt": "Experience the spiritual magnificence of Prayagraj, where three holy rivers converge at Triveni Sangam and millions gather for the world's largest religious festival, Kumbh Mela.",
  "content": "\n        <p>Prayagraj, formerly known as Allahabad, is home to the legendary Triveni Sangam - the sacred confluence of three holy rivers: the Ganges, Yamuna, and the mythical Saraswati. This convergence point is considered one of the holiest places in Hinduism and serves as the primary site for the Kumbh Mela, the world's largest religious gathering.</p>\n        \n        <h2>The Sacred Confluence</h2>\n        <p>The city's ancient name 'Prayag' means 'place of sacrifice,' referring to the legend of Lord Brahma performing a yagna (sacrifice) at this sacred spot where the rivers meet.</p>\n        ",
  "contentSections": [
    {
      "id": "section-1",
      "type": "image-text",
      "title": "Triveni Sangam: Where Three Rivers Meet",
      "content": "<p>The Triveni Sangam is the most sacred spot in Prayagraj, where pilgrims from across the world come to take a holy dip believed to wash away sins and grant moksha (liberation). The confluence is clearly visible, with the muddy waters of the Ganges meeting the clearer waters of the Yamuna, while the mythical Saraswati flows underground.</p><p>Boat rides to the exact confluence point allow pilgrims to perform puja and take the sacred bath at the most auspicious location. The experience is both spiritually uplifting and visually spectacular, especially during sunrise and sunset.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587135941948-670b381f08ce?w=800&h=600&fit=crop",
        "alt": "Triveni Sangam at Prayagraj",
        "caption": "The sacred Triveni Sangam where three holy rivers meet"
      },
      "imagePosition": "center",
      "order": 1
    },
    {
      "id": "section-2",
      "type": "image-text",
      "title": "Kumbh Mela: The Greatest Show of Faith",
      "content": "<p>The Kumbh Mela at Prayagraj is an extraordinary spectacle of faith, devotion, and human gathering. Held every 12 years, with smaller Ardh Kumbh every 6 years, this festival attracts millions of pilgrims, sadhus, and spiritual seekers from around the world.</p><p>The Mela features processions of naked Naga sadhus, mass bathing ceremonies, spiritual discourses, and cultural programs. The temporary city that emerges during Kumbh spans several kilometers and includes facilities for accommodation, food, medical care, and spiritual activities.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1544008230-ac1e1fb4f4f4?w=800&h=600&fit=crop",
        "alt": "Kumbh Mela gathering at Prayagraj",
        "caption": "The magnificent gathering of faith during Kumbh Mela"
      },
      "imagePosition": "left",
      "order": 2
    },
    {
      "id": "section-3",
      "type": "text",
      "title": "Sacred Temples and Historical Sites",
      "content": "<h3>Hanuman Mandir (Bade Hanuman)</h3><p>Famous for its underground sanctum where the deity lies in a reclining position, this temple is unique as the Hanuman idol appears to be sleeping. Legend says that as the Ganga water level rises, it touches the feet of the deity.</p><h3>Mankameshwar Temple</h3><p>One of the oldest Shiva temples in the city, believed to fulfill the wishes of devotees. The temple's ancient architecture and peaceful atmosphere make it a perfect place for meditation.</p><h3>Alopi Devi Temple</h3><p>Unique in that it doesn't house a traditional idol but instead has a wooden doli (palanquin) that is worshipped. This is one of the 51 Shakti Peethas mentioned in Hindu scriptures.</p><h3>Patalpuri Temple</h3><p>An underground temple complex with a series of caves and chambers, this ancient site is associated with sage Bharadwaj and offers a mystical spiritual experience.</p>",
      "order": 3
    },
    {
      "id": "section-4",
      "type": "image-text",
      "title": "Akshayavat: The Immortal Banyan Tree",
      "content": "<p>Located within the Patalpuri Temple complex inside Allahabad Fort, Akshayavat is a sacred banyan tree believed to be immortal (akshaya means eternal). According to Hindu scriptures, this tree will survive even during the cosmic dissolution (pralaya).</p><p>The tree holds immense significance in Hindu mythology and is mentioned in ancient texts. Pilgrims come here to offer prayers and seek blessings. The tree is especially significant during the Kumbh Mela when special ceremonies are performed here.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1587474260584-136574528ed5?w=800&h=600&fit=crop",
        "alt": "Akshayavat banyan tree",
        "caption": "The sacred Akshayavat, believed to be the immortal banyan tree"
      },
      "imagePosition": "right",
      "order": 4
    },
    {
      "id": "section-5",
      "type": "text",
      "title": "Spiritual Practices and Rituals",
      "content": "<h3>Holy Bath at Sangam</h3><p>Taking a dip at the Triveni Sangam is the primary spiritual activity. The best times are during sunrise, sunset, and on auspicious dates like Makar Sankranti, Magh Purnima, and during Kumbh Mela.</p><h3>Pitra Paksha Rituals</h3><p>Prayagraj is especially significant during Pitra Paksha (fortnight for ancestors) when people perform shraddha rituals for their ancestors. The confluence is believed to be highly effective for these ceremonies.</p><h3>Saraswati Ghat Activities</h3><p>Regular aarti ceremonies, yoga sessions, and spiritual discourses take place at various ghats. The evening aarti at Saraswati Ghat is particularly beautiful.</p><h3>Akharas and Ashrams</h3><p>Visit various akharas (monastic orders) and ashrams that maintain the spiritual traditions year-round, not just during Kumbh Mela.</p>",
      "order": 5
    },
    {
      "id": "section-6",
      "type": "image-text",
      "title": "Historical and Cultural Heritage",
      "content": "<p>Beyond its spiritual significance, Prayagraj is rich in history and culture. The Allahabad Fort, built by Emperor Akbar, houses the famous Ashoka Pillar with ancient inscriptions. The city was also the headquarters of India's independence movement and home to the Nehru family.</p><p>Visit the Anand Bhavan museum, explore the vibrant local markets, and experience the confluence of Ganga-Jamuni tehzeeb (culture) that represents the synthesis of Hindu and Muslim traditions in the region.</p>",
      "image": {
        "url": "https://images.unsplash.com/photo-1561361513-2d000a50f0dc?w=800&h=600&fit=crop",
        "alt": "Historical Allahabad Fort",
        "caption": "The historic Allahabad Fort showcases the city's rich cultural heritage"
      },
      "imagePosition": "center",
      "order": 6
    },
    {
      "id": "section-7",
      "type": "text",
      "title": "Planning Your Prayagraj Pilgrimage",
      "content": "<h3>Best Time to Visit</h3><p>October to March offers pleasant weather for outdoor activities and temple visits. Plan your visit during Kumbh Mela for the ultimate spiritual experience, but book accommodation well in advance. Makar Sankranti and Magh Mela (January-February) are also highly auspicious times.</p><h3>Getting There</h3><p>Prayagraj is well-connected by air, rail, and road. The city has its own airport with regular flights from major cities. Multiple trains connect Prayagraj to all major Indian cities. The city is also accessible by road from nearby cities like Varanasi and Lucknow.</p><h3>Accommodation</h3><p>Options range from budget dharamshalas and guesthouses to luxury hotels. During Kumbh Mela, special tent accommodations and camp sites are set up. Book early during festival seasons.</p><h3>Local Transportation</h3><p>Use cycle rickshaws, auto-rickshaws, or taxis for city travel. Boats are essential for reaching the exact confluence point at Triveni Sangam. Many sites are within walking distance of each other in the old city area.</p>",
      "order": 7
    }
  ],
  "featuredImage": {
    "url": "https://images.unsplash.com/photo-1587135941948-670b381f08ce?w=800&h=400&fit=crop",
    "alt": "Triveni Sangam Prayagraj"
  },
  "images": [],
  "author": {
    "$oid": "68fdbb0fdd08ede9e662a188"
  },
  "categories": [
    {
      "$oid": "68fdbb11dd08ede9e662a199"
    }
  ],
  "tags": [
    "prayagraj",
    "allahabad",
    "kumbh-mela",
    "triveni-sangam",
    "ganges",
    "yamuna",
    "saraswati",
    "pilgrimage",
    "hinduism",
    "spiritual",
    "india"
  ],
  "status": "published",
  "isPremium": false,
  "isFeatured": true,
  "readTime": 9,
  "viewCount": 0,
  "likeCount": 0,
  "commentCount": 0,
  "likes": [],
  "comments": [],
  "publishedAt": {
    "$date": "2025-10-26T06:09:22.095Z"
  },
  "createdAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "updatedAt": {
    "$date": "2025-10-26T06:09:22.295Z"
  },
  "__v": 0
}]